; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_14)

(:domain logistics)

(:objects
	obj0 obj2 obj9 - airport
	obj1 obj3 obj10 - city
	obj4 obj5 obj7 obj17 obj18 obj19 obj20 obj21 obj22 - location
	obj6 obj8 obj11 - truck
	obj12 obj13 obj14 obj15 - package
	obj16 - airplane
)

(:init
	(at obj6 obj0)
	(at obj8 obj2)
	(at obj11 obj9)
	(at obj12 obj9)
	(at obj13 obj2)
	(at obj14 obj0)
	(at obj15 obj2)
	(at obj16 obj9)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj4 obj3)
	(in-city obj5 obj3)
	(in-city obj7 obj1)
	(in-city obj9 obj10)
	(in-city obj17 obj10)
	(in-city obj18 obj1)
	(in-city obj19 obj1)
	(in-city obj20 obj3)
	(in-city obj21 obj10)
	(in-city obj22 obj10)
)

(:goal (and
	(at obj12 obj19)
	(at obj13 obj22)
	(at obj14 obj17)
	(at obj15 obj18)
))
)

; plan
1. (drive obj11 obj9 obj17)
   deleted: (at obj11 obj9)
   added: (at obj11 obj17)
   goals met: 0 of 4
2. (drive obj6 obj0 obj7)
   deleted: (at obj6 obj0)
   added: (at obj6 obj7)
   goals met: 0 of 4
3. (drive obj8 obj2 obj5)
   deleted: (at obj8 obj2)
   added: (at obj8 obj5)
   goals met: 0 of 4
4. (load obj16 obj12 obj9)
   deleted: (at obj12 obj9)
   added: (in obj12 obj16)
   goals met: 0 of 4
5. (fly obj16 obj9 obj0)
   deleted: (at obj16 obj9)
   added: (at obj16 obj0)
   goals met: 0 of 4
6. (load obj16 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj16)
   goals met: 0 of 4
7. (fly obj16 obj0 obj2)
   deleted: (at obj16 obj0)
   added: (at obj16 obj2)
   goals met: 0 of 4
8. (drive obj11 obj17 obj9)
   deleted: (at obj11 obj17)
   added: (at obj11 obj9)
   goals met: 0 of 4
9. (drive obj8 obj5 obj2)
   deleted: (at obj8 obj5)
   added: (at obj8 obj2)
   goals met: 0 of 4
10. (load obj16 obj13 obj2)
   deleted: (at obj13 obj2)
   added: (in obj13 obj16)
   goals met: 0 of 4
11. (load obj16 obj15 obj2)
   deleted: (at obj15 obj2)
   added: (in obj15 obj16)
   goals met: 0 of 4
12. (fly obj16 obj2 obj0)
   deleted: (at obj16 obj2)
   added: (at obj16 obj0)
   goals met: 0 of 4
13. (drive obj11 obj9 obj17)
   deleted: (at obj11 obj9)
   added: (at obj11 obj17)
   goals met: 0 of 4
14. (drive obj8 obj2 obj5)
   deleted: (at obj8 obj2)
   added: (at obj8 obj5)
   goals met: 0 of 4
15. (drive obj11 obj17 obj21)
   deleted: (at obj11 obj17)
   added: (at obj11 obj21)
   goals met: 0 of 4
16. (drive obj6 obj7 obj0)
   deleted: (at obj6 obj7)
   added: (at obj6 obj0)
   goals met: 0 of 4
17. (drive obj8 obj5 obj4)
   deleted: (at obj8 obj5)
   added: (at obj8 obj4)
   goals met: 0 of 4
18. (fly obj16 obj0 obj9)
   deleted: (at obj16 obj0)
   added: (at obj16 obj9)
   goals met: 0 of 4
19. (drive obj11 obj21 obj22)
   deleted: (at obj11 obj21)
   added: (at obj11 obj22)
   goals met: 0 of 4
20. (drive obj6 obj0 obj19)
   deleted: (at obj6 obj0)
   added: (at obj6 obj19)
   goals met: 0 of 4
21. (unload obj16 obj13 obj9)
   deleted: (in obj13 obj16)
   added: (at obj13 obj9)
   goals met: 0 of 4
22. (unload obj16 obj14 obj9)
   deleted: (in obj14 obj16)
   added: (at obj14 obj9)
   goals met: 0 of 4
23. (fly obj16 obj9 obj0)
   deleted: (at obj16 obj9)
   added: (at obj16 obj0)
   goals met: 0 of 4
24. (drive obj11 obj22 obj9)
   deleted: (at obj11 obj22)
   added: (at obj11 obj9)
   goals met: 0 of 4
25. (drive obj6 obj19 obj0)
   deleted: (at obj6 obj19)
   added: (at obj6 obj0)
   goals met: 0 of 4
26. (drive obj8 obj4 obj2)
   deleted: (at obj8 obj4)
   added: (at obj8 obj2)
   goals met: 0 of 4
27. (unload obj16 obj12 obj0)
   deleted: (in obj12 obj16)
   added: (at obj12 obj0)
   goals met: 0 of 4
28. (unload obj16 obj15 obj0)
   deleted: (in obj15 obj16)
   added: (at obj15 obj0)
   goals met: 0 of 4
29. (fly obj16 obj0 obj9)
   deleted: (at obj16 obj0)
   added: (at obj16 obj9)
   goals met: 0 of 4
30. (drive obj8 obj2 obj4)
   deleted: (at obj8 obj2)
   added: (at obj8 obj4)
   goals met: 0 of 4
31. (load obj11 obj13 obj9)
   deleted: (at obj13 obj9)
   added: (in obj13 obj11)
   goals met: 0 of 4
32. (load obj11 obj14 obj9)
   deleted: (at obj14 obj9)
   added: (in obj14 obj11)
   goals met: 0 of 4
33. (load obj6 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj6)
   goals met: 0 of 4
34. (load obj6 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj6)
   goals met: 0 of 4
35. (drive obj11 obj9 obj22)
   deleted: (at obj11 obj9)
   added: (at obj11 obj22)
   goals met: 0 of 4
36. (drive obj6 obj0 obj18)
   deleted: (at obj6 obj0)
   added: (at obj6 obj18)
   goals met: 0 of 4
37. (drive obj8 obj4 obj20)
   deleted: (at obj8 obj4)
   added: (at obj8 obj20)
   goals met: 0 of 4
38. (fly obj16 obj9 obj2)
   deleted: (at obj16 obj9)
   added: (at obj16 obj2)
   goals met: 0 of 4
39. (unload obj11 obj13 obj22)
   deleted: (in obj13 obj11)
   added: (at obj13 obj22)
   goals met: 1 of 4
40. (unload obj6 obj15 obj18)
   deleted: (in obj15 obj6)
   added: (at obj15 obj18)
   goals met: 2 of 4
41. (drive obj11 obj22 obj17)
   deleted: (at obj11 obj22)
   added: (at obj11 obj17)
   goals met: 2 of 4
42. (drive obj6 obj18 obj19)
   deleted: (at obj6 obj18)
   added: (at obj6 obj19)
   goals met: 2 of 4
43. (drive obj8 obj20 obj2)
   deleted: (at obj8 obj20)
   added: (at obj8 obj2)
   goals met: 2 of 4
44. (fly obj16 obj2 obj0)
   deleted: (at obj16 obj2)
   added: (at obj16 obj0)
   goals met: 2 of 4
45. (unload obj11 obj14 obj17)
   deleted: (in obj14 obj11)
   added: (at obj14 obj17)
   goals met: 3 of 4
46. (unload obj6 obj12 obj19)
   deleted: (in obj12 obj6)
   added: (at obj12 obj19)
   goals met: 4 of 4
